# ðŸ“Š LEVEL 1 â€” Sales Analysis

In [7]:
from sqlalchemy import create_engine
import pandas as pd

In [8]:
engine = create_engine('mysql+pymysql://root:password@127.0.0.1/crm_sales')

In [9]:
df = pd.read_csv('CRM_Data/sales_pipeline.csv')
df.to_sql('sales_pipeline', con=engine, if_exists='replace', index=False) # now nan value apper from sql

8800

In [10]:
tables = ['accounts','data_dictionary','products', 'sales_pipeline', 'sales_teams']
for table in tables:
    query = f"""select * from {table} limit 10;"""
    table_data = pd.read_sql(query, engine)
    print(f'{table} Table')
    display(table_data)

accounts Table

,account,sector,year_established,revenue,employees,office_location,subsidiary_of
0,Acme Corporation,technolgy,1996,1100.04,2822,United States,
1,Betasoloin,medical,1999,251.41,495,United States,
2,Betatech,medical,1986,647.18,1185,Kenya,
3,Bioholding,medical,2012,587.34,1356,Philipines,
4,Bioplex,medical,1991,326.82,1016,United States,
5,Blackzim,retail,2009,497.11,1588,United States,
6,Bluth Company,technolgy,1993,1242.32,3027,United States,Acme Corporation
7,Bubba Gump,software,2002,987.39,2253,United States,
8,Cancity,retail,2001,718.62,2448,United States,
9,Cheers,entertainment,1993,4269.90,6472,United States,Massive Dynamic

data_dictionary Table

      Table             Field                          Description
0  accounts           account                         Company name
1  accounts            sector                             Industry
2  accounts  year_established                     Year Established
3  accounts           revenue  Annual revenue (in millions of USD)
4  accounts         employees                  Number of employees
5  accounts   office_location                         Headquarters
6  accounts     subsidiary_of                       Parent company
7  products           product                         Product name
8  products            series                       Product series
9  products       sales_price               Suggested retail price

products Table

          product series  sales_price
0       GTX Basic    GTX          550
1         GTX Pro    GTX         4821
2      MG Special     MG           55
3     MG Advanced     MG         3393
4    GTX Plus Pro    GTX         5482
5  GTX Plus Basic    GTX         1096
6         GTK 500    GTK        26768

sales_pipeline Table

,opportunity_id,sales_agent,product,account,deal_stage,engage_date,close_date,close_value
0,1C1I7A6R,Moses Frase,GTX Plus Basic,Cancity,Won,10/20/2016,3/1/2017,1054.0
1,Z063OYW0,Darcel Schlecht,GTXPro,Isdom,Won,10/25/2016,3/11/2017,4514.0
2,EC4QE1BX,Darcel Schlecht,MG Special,Cancity,Won,10/25/2016,3/7/2017,50.0
3,MV1LWRNH,Moses Frase,GTX Basic,Codehow,Won,10/25/2016,3/9/2017,588.0
4,PE84CX4O,Zane Levy,GTX Basic,Hatfan,Won,10/25/2016,3/2/2017,517.0
5,ZNBS69V1,Anna Snelling,MG Special,Ron-tech,Won,10/29/2016,3/1/2017,49.0
6,9ME3374G,Vicki Laflamme,MG Special,J-Texon,Won,10/30/2016,3/2/2017,57.0
7,7GN8Q4LL,Markita Hansen,GTX Basic,Cheers,Won,11/1/2016,3/7/2017,601.0
8,OLK9LKZB,Niesha Huffines,GTX Plus Basic,Zumgoity,Won,11/1/2016,3/3/2017,1026.0
9,HAXMC4IX,James Ascencio,MG Advanced,None,Engaging,11/3/2016,None,NaN

sales_teams Table

          sales_agent           manager regional_office
0       Anna Snelling  Dustin Brinkmann         Central
1      Cecily Lampkin  Dustin Brinkmann         Central
2   Versie Hillebrand  Dustin Brinkmann         Central
3     Lajuana Vencill  Dustin Brinkmann         Central
4         Moses Frase  Dustin Brinkmann         Central
5  Jonathan Berthelot     Melvin Marxen         Central
6   Marty Freudenburg     Melvin Marxen         Central
7    Gladys Colclough     Melvin Marxen         Central
8     Niesha Huffines     Melvin Marxen         Central
9     Darcel Schlecht     Melvin Marxen         Central

In [ ]:
tables = ['accounts','data_dictionary','products', 'sales_pipeline', 'sales_teams']
for table in tables:
    df = pd.read_csv(f"CRM_Data/{table}.csv")
    print(f"Table name :--{table}")
    display(df.info())

Table name :--accounts
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85 entries, 0 to 84
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   account           85 non-null     object
 1   sector            85 non-null     object
 2   year_established  85 non-null     int64
 3   revenue           85 non-null     float64
 4   employees         85 non-null     int64
 5   office_location   85 non-null     object
 6   subsidiary_of     15 non-null     object
dtypes: float64(1), int64(2), object(4)
memory usage: 4.8+ KB

None

Table name :--data_dictionary
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Table        21 non-null     object
 1   Field        21 non-null     object
 2   Description  21 non-null     object
dtypes: object(3)
memory usage: 636.0+ bytes

None

Table name :--products
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   product      7 non-null      object
 1   series       7 non-null      object
 2   sales_price  7 non-null      int64
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

None

Table name :--sales_pipeline
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8800 entries, 0 to 8799
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   opportunity_id  8800 non-null   object
 1   sales_agent     8800 non-null   object
 2   product         8800 non-null   object
 3   account         7375 non-null   object
 4   deal_stage      8800 non-null   object
 5   engage_date     8300 non-null   object
 6   close_date      6711 non-null   object
 7   close_value     6711 non-null   float64
dtypes: float64(1), object(7)
memory usage: 550.1+ KB

None

Table name :--sales_teams
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   sales_agent      35 non-null     object
 1   manager          35 non-null     object
 2   regional_office  35 non-null     object
dtypes: object(3)
memory usage: 972.0+ bytes

None

### Q1. Display all products with their series and sales price.

In [ ]:
query = f"""select * from products;"""
table_data = pd.read_sql(query, engine)
display(table_data)

          product series  sales_price
0       GTX Basic    GTX          550
1         GTX Pro    GTX         4821
2      MG Special     MG           55
3     MG Advanced     MG         3393
4    GTX Plus Pro    GTX         5482
5  GTX Plus Basic    GTX         1096
6         GTK 500    GTK        26768

### Q2. Find the average sales price of products in each series.

In [ ]:
query = f"""select series,avg(sales_price) from products group by series;"""
table_data = pd.read_sql(query, engine)
display(table_data)

  series  avg(sales_price)
0    GTX           2987.25
1     MG           1724.00
2    GTK          26768.00

### Q3. Join sales_pipeline with products and show each opportunityâ€™s product name, deal stage, and sales price.

In [16]:
query = f"""select sp.opportunity_id,p.product,sp.deal_stage,p.sales_price 
            from sales_pipeline as sp 
            join products as p 
            on sp.product = p.product;"""
table_data = pd.read_sql(query, engine)
display(table_data)

     opportunity_id         product   deal_stage  sales_price
0          1C1I7A6R  GTX Plus Basic          Won         1096
1          EC4QE1BX      MG Special          Won           55
2          MV1LWRNH       GTX Basic          Won          550
3          PE84CX4O       GTX Basic          Won          550
4          ZNBS69V1      MG Special          Won           55
...             ...             ...          ...          ...
7315       9MIWFW5J     MG Advanced  Prospecting         3393
7316       6SLKZ8FI     MG Advanced  Prospecting         3393
7317       LIB4KUZJ     MG Advanced  Prospecting         3393
7318       18IUIUK0     MG Advanced  Prospecting         3393
7319       8I5ONXJX     MG Advanced  Prospecting         3393

[7320 rows x 4 columns]

### Q4. Show all deals handled by Darcel Schlecht along with their status (Won/Lost) and close value.

In [24]:
query = f"""select sales_agent,deal_stage,count(close_value ) as count_of_close_values
            from sales_pipeline 
            where sales_agent = 'Darcel Schlecht' and (deal_stage ='Won' or deal_stage ='Lost')
            group by deal_stage ;"""
table_data = pd.read_sql(query, engine)
display(table_data)

       sales_agent deal_stage  count_of_close_values
0  Darcel Schlecht        Won                    349
1  Darcel Schlecht       Lost                    204

### Q5. Find the total number of deals per deal_stage (Won, Lost, Engaging,Prospecting).

In [9]:
query = f"""select deal_stage,count(deal_stage) from sales_pipeline group by deal_stage;"""
table_data = pd.read_sql(query, engine)
display(table_data)

    deal_stage  count(deal_stage)
0          Won               4238
1     Engaging               1589
2         Lost               2473
3  Prospecting                500

### Q6. List all Won deals with close_value greater than 1000.

In [ ]:
query = f"""select * from sales_pipeline 
            where deal_stage = 'Won' and close_value > 1000 ;"""
table_data = pd.read_sql(query, engine)
display(table_data)

,opportunity_id,sales_agent,product,account,deal_stage,engage_date,close_date,close_value
0,1C1I7A6R,Moses Frase,GTX Plus Basic,Cancity,Won,10/20/2016,3/1/2017,1054.0
1,Z063OYW0,Darcel Schlecht,GTXPro,Isdom,Won,10/25/2016,3/11/2017,4514.0
2,OLK9LKZB,Niesha Huffines,GTX Plus Basic,Zumgoity,Won,11/1/2016,3/3/2017,1026.0
3,S8DX3XOU,James Ascencio,GTX Plus Pro,Sunnamplex,Won,11/4/2016,3/10/2017,5169.0
4,ENB2XD8G,Maureen Marcano,GTX Plus Pro,Sonron,Won,11/4/2016,3/6/2017,4631.0
...,...,...,...,...,...,...,...,...
2375,B50N6RL3,Gladys Colclough,MG Advanced,Genco Pura Olive Oil Company,Won,12/21/2017,12/30/2017,3494.0
2376,MSN4ZNU6,Violet Mclelland,MG Advanced,Betasoloin,Won,12/22/2017,12/28/2017,3673.0
2377,VDGA4KXA,Violet Mclelland,GTX Plus Basic,Bluth Company,Won,12/24/2017,12/30/2017,1093.0
2378,6WCNNK5J,Maureen Marcano,GTXPro,Hottechi,Won,12/26/2017,12/29/2017,4433.0
2379,YJTQSZ9D,Gladys Colclough,GTX Plus Basic,Inity,Won,12/27/2017,12/30/2017,1052.0

### Q7. Find top 5 products that generated the highest total deal value.

In [32]:
query = f"""select product,sum(close_value) as Total_deal_value
            from sales_pipeline 
            where deal_stage = "Won"
            group by product
            order by Total_deal_value desc limit 5
             ;"""
table_data = pd.read_sql(query, engine)
display(table_data)

          product  Total_deal_value
0          GTXPro         3510578.0
1    GTX Plus Pro         2629651.0
2     MG Advanced         2216387.0
3  GTX Plus Basic          705275.0
4       GTX Basic          499263.0

### Q8. Show the total revenue from all â€œWonâ€ deals.

In [33]:
query = f"""select sum(ac.revenue) as Total_revenue,
            sp.deal_stage from accounts as ac
            join sales_pipeline as sp 
            on ac.account = sp.account
            where sp.deal_stage = 'Won';"""
table_data = pd.read_sql(query, engine)
display(table_data)

   Total_revenue deal_stage
0    10576285.17        Won

### Q9. Find the total number of Won deals per sales agent.

In [40]:
query = f"""select sales_agent,count(deal_stage) as Total_Won 
            from sales_pipeline
            where deal_stage = 'Won' 
            group by sales_agent
            order by Total_Won desc;"""
table_data = pd.read_sql(query, engine)
display(table_data)

           sales_agent  Total_Won
0      Darcel Schlecht        349
1       Vicki Laflamme        221
2      Kary Hendrixson        209
3        Anna Snelling        208
4    Versie Hillebrand        176
5        Kami Bicknell        174
6   Jonathan Berthelot        171
7         Cassey Cress        163
8            Zane Levy        161
9        Donn Cantrell        158
10        Reed Clapper        155
11       Corliss Cosme        150
12     Maureen Marcano        149
13      James Ascencio        135
14    Gladys Colclough        135
15      Markita Hansen        130
16         Moses Frase        129
17     Lajuana Vencill        127
18    Violet Mclelland        122
19   Marty Freudenburg        122
20     Daniell Hammack        114
21       Hayden Neloms        107
22      Cecily Lampkin        107
23     Niesha Huffines        105
24           Boris Faz        101
25        Elease Gluck         80
26  Rosie Papadopoulos         78
27       Garret Kinder         75
28     Rosalina Dieter         72
29      Wilburn Farren         55

### Q10. Display all deals handled by sales agents in the East region (join sales_pipeline and sales_teams).

In [41]:
query = f"""select sp.product,sp.account,sp.sales_agent,st.regional_office,sp.deal_stage 
            from sales_teams as st 
            join sales_pipeline as sp 
            on st.sales_agent = sp.sales_agent
            where regional_office = 'East';"""
table_data = pd.read_sql(query, engine)
display(table_data)

,product,account,sales_agent,regional_office,deal_stage
0,GTXPro,Xx-zobam,Daniell Hammack,East,Lost
1,GTX Plus Basic,Vehement Capital Partners,Violet Mclelland,East,Won
2,GTX Plus Pro,Xx-zobam,Violet Mclelland,East,Lost
3,MG Advanced,Zotware,Rosie Papadopoulos,East,Lost
4,GTX Basic,Acme Corporation,Reed Clapper,East,Won
...,...,...,...,...,...
2286,GTX Plus Basic,None,Wilburn Farren,East,Engaging
2287,GTX Plus Pro,None,Cassey Cress,East,Engaging
2288,MG Advanced,Betasoloin,Violet Mclelland,East,Won
2289,GTX Basic,Ganjaflex,Cassey Cress,East,Won
2290,GTX Plus Basic,Bluth Company,Violet Mclelland,East,Won

### Q11. Find the total number of employees across all companies.

In [15]:
query = """select sum(employees) as Total_employees from accounts ;"""
table_data = pd.read_sql(query, engine)
display(table_data)

   Total_employees
0         396170.0

### Q12. Show all medical sector companies and their revenue.

In [42]:
query = """select sector,account,revenue from accounts where sector = 'medical';"""
table_data = pd.read_sql(query, engine)
display(table_data)

     sector                account  revenue
0   medical             Betasoloin   251.41
1   medical               Betatech   647.18
2   medical             Bioholding   587.34
3   medical                Bioplex   326.82
4   medical                 Condax     4.54
5   medical                  Isdom  3178.24
6   medical               Labdrill  2741.37
7   medical             Lexiqvolax  1618.89
8   medical               Ron-tech  3922.42
9   medical                  Silis  2818.38
10  medical  The New York Inquirer   439.21
11  medical               Zumgoity   441.08

### Q13. List all companies that are subsidiaries of another company.

In [17]:
query = """select * from accounts WHERE subsidiary_of IS NOT NULL AND subsidiary_of <> '';"""
table_data = pd.read_sql(query, engine)
display(table_data)

,account,sector,year_established,revenue,employees,office_location,subsidiary_of
0,Bluth Company,technolgy,1993,1242.32,3027,United States,Acme Corporation
1,Cheers,entertainment,1993,4269.90,6472,United States,Massive Dynamic
2,Codehow,software,1998,2714.90,2641,United States,Acme Corporation
3,Dalttechnology,software,2013,98.79,96,United States,Bubba Gump
4,dambase,marketing,1995,2173.98,2928,United States,Inity
5,Donquadtech,technolgy,1992,1712.68,3194,United States,Acme Corporation
6,Faxquote,telecommunications,1995,1825.82,5595,United States,Sonron
7,Funholding,finance,1991,2819.50,7227,United States,Golddex
8,Gogozoom,telecommunications,2007,86.68,187,United States,Sonron
9,Iselectrics,technolgy,2011,527.11,1428,United States,Acme Corporation
10,Nam-zim,services,1987,405.59,1179,Brazil,Warephase
11,Scotfind,software,1996,6354.87,16780,United States,Bubba Gump
12,Scottech,marketing,2012,45.39,100,United States,Inity
13,Treequote,telecommunications,1988,5266.09,8595,United States,Sonron
14,Vehement Capital Partners,finance,1993,646.10,883,United States,Golddex

### Q14. Find the oldest company and its year of establishment.

In [43]:
query = """select * from accounts order by  year_established Asc limit 1;"""
table_data = pd.read_sql(query,engine)
display(table_data)

,account,sector,year_established,revenue,employees,office_location,subsidiary_of
0,Zotware,software,1979,4478.47,13809,United States,

### Q15. Find the average revenue of all companies.

In [48]:
query = """SELECT AVG(revenue) AS Avg_revenue_all_companies
FROM accounts;"""
table_data = pd.read_sql(query,engine)
display(table_data)

   Avg_revenue_all_companies
0                1994.632941